Revit 2027 API
SymbolTypeId.Joule Property
 Symbol J, indicating unit Joules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Joule { get; }
Public Shared ReadOnly Property Joule As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Joule {
	ForgeTypeId^ get ();
}
static member Joule : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace